["<h3 id=\"version-2-7-4-\">version 2.7.4:</h3>\r\n<ul>\r\n<li>Improvement: Update the mouse scroll wheel of all input spinner controls that are used in Layers, Asset and Scene Settings, etc. You can easily change the value of the spinner control using the mouse scroll wheel only when the control is selected(#598)</li>\r\n<li>Fix an issue that the delay and duration of the assets are randomly changed depending on where the mouse cursor is positioned while scrolling the mouse wheel in the Layers list.</li>\r\n<li>Fix minor bugs and improvements(#599)</li>\r\n</ul>\r\n","<h3 id=\"version-2-7-3-\">version 2.7.3:</h3>\r\n<ul>\r\n<li>New Feature: Provide a means of setting precise size and position of assets in a scene. You can adjust the position of assets on the canvas by setting X and Y coordinates based on &quot;Top Left Corner&quot; instead of &quot;Center&quot; of the assets on Asset Settings dialog. In addition, you can also easily look at their location and size with the tooltips displayed when resizing and moving assets on the canvas(#351)</li>\r\n<li>New Feature: Add ability to manually enable/disable white fills for black and white images when using custom background images. You can manually set whether to draw the white background of the black and white images by On/Off the &quot;White Fill&quot; option added to the Asset Settings dialog. Note: this option can only be set for black and white asset images when making a video using custom background images with the Customboard or Glassboard(#595)</li>\r\n<li>Fix minor bugs and improvements for Selection Handle of the asset(#597)</li>\r\n</ul>","<h3 id=\"version-2-7-2-\">version 2.7.2:</h3>\r\n<ul>\r\n<li>New Feature: Add ability to share video projects with other Doodly users. You can share projects with your friends using the newly added &quot;Share&quot; item in the context menu of the project list. The shared project will be duplicated like a new project into the &quot;Shared Projects&quot; folder of the friend&#39;s account(#508)</li>\r\n<li>Fix an issue that the Fade reveal mode does not work properly with some asset images(#593)</li>\r\n</ul>","<h3 id=\"version-2-7-1-\">version 2.7.1:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements(migration)</li>\r\n</ul>","<h3 id=\"version-2-7-0-\">version 2.7.0:</h3>\r\n<ul>\r\n<li>New Feature: Allow users to use custom characters exported from the People Builder software. So users can upload their customized characters into the Characters tab and can also use color characters in videos as they want, without having to purchase Doodly Rainbow(#582)</li>\r\n<li>Improvement: Allow users to delete multiple fonts and sounds that they have uploaded at once(#558)</li>\r\n<li>Improvement: Add ability to remove a specific user&#39;s saved session by setting an option in the admin area(#563)</li>\r\n</ul>","<h3 id=\"version-2-6-14-\">version 2.6.14:</h3>\r\n<ul>\r\n<li>Improvement: Update Doodler Toolbox(#575)</li>\r\n<li>Fix an issue that asset images become translucent on the canvas when switching from blackboard to custom(#580)</li>\r\n<li>Fix minor bugs and improvements(#561, #577)</li>\r\n</ul>","<h3 id=\"version-2-6-13-\">version 2.6.13:</h3>\r\n<ul>\r\n<li>Improvement: Allow to send to back and bring forward even if the asset images are not overlaid(#567)</li>\r\n<li>Fix minor bugs and improvements(#559, #569, #560)</li>\r\n</ul>","<h3 id=\"version-2-6-12-\">version 2.6.12:</h3>\r\n<ul>\r\n<li>Fix a bug that audio segments delayed in the exported video that have a lot of recorded audios(#557)</li>\r\n<li>Fix a minor bug on the text box(#555)</li>\r\n</ul>","<h3 id=\"version-2-6-11-\">version 2.6.11:</h3>\r\n<ul>\r\n<li>Improvement: Add an ability to convert projects/scenes made by using image assets that don&#39;t have rainbow paths into Rainbow(#544)</li>\r\n<li>Fix minor bugs and improvements(#545)</li>\r\n</ul>","<h3 id=\"version-2-6-10-\">version 2.6.10:</h3>\r\n<ul>\r\n<li>Fix an issue that removing white fills for black &amp; white assets when using custom background images(#541)</li>\r\n</ul>","<h3 id=\"version-2-6-9-\">version 2.6.9:</h3>\r\n<ul>\r\n<li>New feature: A Doodly Tutorials channel has been opened on Youtube for free tutorial videos! Add a new banner to the startup screen to make it easier to get to the channel(#538)</li>\r\n<li>Improvement: Add an ability to change the icon to Unlock after clicking the Lock button for custom resolution(#535)</li>\r\n<li>Fix an issue that when clicking the &#39;x&#39; button on the pop-up dialog in order to return to &#39;My Videos&#39; from a project, it is executing discard instead of reverting back to the project(#536)</li>\r\n<li>Fix minor bugs and improvements(#534)</li>\r\n</ul>","<h3 id=\"version-2-6-8-\">version 2.6.8:</h3>\r\n<ul>\r\n<li>New feature: Allow users to cancel their Doodly subscription. If you are on a subscription plan, you can cancel at any time from the User Details screen in Doodly(#532)</li>\r\n<li>Fix a bug that the background color of the black &amp; white images becomes slightly darker on the canvas(#533)</li>\r\n</ul>","<h3 id=\"version-2-6-7-\">version 2.6.7:</h3>\r\n<ul>\r\n<li>New feature: Add ability to change the font of the selected text on the canvas when selecting a font in the list(#502)</li>\r\n<li>New feature: Add ability to use the custom background to Glassboard(#465)</li>\r\n<li>Improvement: Allow users to increase/decrease the delay time of assets with the duration when dragging the edge of a scene(#528)</li>\r\n<li>Fix minor bugs and improvements(#530, #531)</li>\r\n</ul>","<h3 id=\"version-2-6-6-\">version 2.6.6:</h3>\r\n<ul>\r\n<li>New feature: Add Save As feature(#91)</li>\r\n<li>New feature: Add a File menu with Save, Save As, Close, and Export Video options. Also, allow users to use shortcuts for all options of the menu.</li>\r\n</ul>","<h3 id=\"version-2-6-5-\">version 2.6.5:</h3>\r\n<ul>\r\n<li>Improvement: Add 70 new fonts and a feature to search them. For Standard users, 35 fonts are available and all of those fonts are available after upgrading to the Enterprise level(#281)</li>\r\n<li>Improvement: Allow indenting lines of text with spaces(#527)</li>\r\n<li>Improvement: Update the Voomly logo on the home screen(#526)</li>\r\n</ul>","<h3 id=\"version-2-6-4-\">version 2.6.4:</h3>\r\n<ul>\r\n<li>Merry Christmas &amp; Happy New Year!</li>\r\n<li>New feature: Snap To Grid(#258)</li>\r\n<li>Fix a bug that the project folders are not consistent across different devices(#521)</li>\r\n<li>Fix a bug that Edit menu functions don&#39;t work after replacing assets(#523)</li>\r\n</ul>","<h3 id=\"version-2-6-3-\">version 2.6.3:</h3>\r\n<ul>\r\n<li>Improvement: Add new 6 cartoon 3D hands each for the whiteboard, chalkboard, and glassboard(#512)</li>\r\n<li>Improvement: Update the Video &amp; Scene Settings dialogue(#513, #516)</li>\r\n<li>Improvement: Allow to change the color for the non-multi colored text on Asset Settings(#520)</li>\r\n</ul>","<h3 id=\"version-2-6-2-\">version 2.6.2:</h3>\r\n<ul>\r\n<li>Improvement: Add a warning that notifies a user that the same file name exists in the export directory(#511)</li>\r\n<li>Fix a bug that the font replacement of the text doesn&#39;t work properly(#517)</li>\r\n<li>Fix minor bugs and improvements(#518, #519)</li>\r\n</ul>","<h3 id=\"version-2-6-1-\">version 2.6.1:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements(#514, #515)</li>\r\n</ul>","<h3 id=\"version-2-6-0-\">version 2.6.0:</h3>\r\n<ul>\r\n<li>New feature: The highly requested, Change color of words in a text box, the feature has been added!(#176)</li>\r\n<li>Improvement: Draw Arabic words with joined characters(#397)</li>\r\n</ul>","<h3 id=\"version-2-5-9-\">version 2.5.9:</h3>\r\n<ul>\r\n<li>Fix a bug that sound effects are not synchronized with assets on high-resolution videos(#499)</li>\r\n<li>Fix a bug that Fade in/out features are not applied when previewing a video(#509)</li>\r\n<li>Fix minor bugs and improvements(#510)</li>\r\n</ul>","<h3 id=\"version-2-5-8-\">version 2.5.8:</h3>\r\n<ul>\r\n<li>Improvement: Audio timeline updated to allow users to even add long audio files(#370)</li>\r\n<li>Improvement: Allow users to import encrypted free image bundles(#492)</li>\r\n</ul>","<h3 id=\"version-2-5-7-\">version 2.5.7:</h3>\r\n<ul>\r\n<li>Improvement: Allow users to search all assets for purchased bundles(image, audio) in the Marketplace tab at once(#496)</li>\r\n<li>Fix a bug that audio gets truncated in some cases when adding it onto the timeline(#497)</li>\r\n</ul>","<h3 id=\"version-2-5-6-\">version 2.5.6:</h3>\r\n<ul>\r\n<li>Improvement: Add new 50 hands each for the whiteboard, chalkboard, and glassboard(#482, #483, #484)</li>\r\n</ul>","<h3 id=\"version-2-5-5-\">version 2.5.5:</h3>\r\n<ul>\r\n<li>Improvement: Add a &quot;Marketplace&quot; link button in the sound effects dialogue allows navigating to Doodly Marketplace where you can purchase new audio bundles(#491)</li>\r\n<li>Fix a bug that Doodler Toolbox doesn&#39;t show entirely with the small resolution(#493)</li>\r\n<li>Fix minor bugs and improvements(#490, #494, #495)</li>\r\n</ul>","<h3 id=\"version-2-5-4-\">version 2.5.4:</h3>\r\n<ul>\r\n<li>Improvement: Allow users to drag &amp; drop music into the voiceover timeline.</li>\r\n</ul>","<h3 id=\"version-2-5-3-\">version 2.5.3:</h3>\r\n<ul>\r\n<li>Fix a bug that changing the hand style to &quot;no hand&quot; in Scene Settings does not activate the save button(#486)</li>\r\n<li>Fix minor bugs and improvements(#485, #487, #488)</li>\r\n</ul>","<h3 id=\"version-2-5-2-\">version 2.5.2:</h3>\r\n<ul>\r\n<li>Improvement: Allow users to resize Projects &amp; Templates panels on the home screen(#478)</li>\r\n<li>Improvement: Allow users to clear the sound effect set on the asset.</li>\r\n<li>Improvement: Add a preview button allows previewing of the video for the template.</li>\r\n</ul>","<h3 id=\"version-2-5-1-\">version 2.5.1:</h3>\r\n<ul>\r\n<li>Fix minor bugs(#479, #480)</li>\r\n</ul>","<h3 id=\"version-2-5-0-\">version 2.5.0:</h3>\r\n<ul>\r\n<li>New Feature: The highly requested, Doodle Templates, feature has been added! By default, you will have access to either Standard, or Enterprise (plus Standard) level templates depending on your Doodly membership level. You may also purchase Premium templates from the Doodly Marketplace. Additional templates will be added over time. Each template comes complete with images, background music, and subtitles (which you can use as a voiceover script, should you add your own voiceover). You can turn the subtitles off, as well, from within the scene settings dialogue. Templates can be used as many times as you wish, and can be customized and edited as well(#433)</li>\r\n<li>New Feature: Doodlers may now add sound effects to any asset. You may add sound effects to the Enter and Exit animations for each asset from within the Asset Settings dialogue. 100 common sound effects are included in this new Doodly update. Additional sound effects may be purchased from the Doodly Marketplace, and you may also import your own sound effects(#459, #460)</li>\r\n<li>Fix a bug that GIF stops at 1st frame instead of stays the last frame after finishing the loop(#471)</li>\r\n</ul>","<h3 id=\"version-2-4-15-\">version 2.4.15:</h3>\r\n<ul>\r\n<li>Improvement: Update the title of the assets list to &quot;Layers&quot; instead of &quot;Items&quot; in the right panel and improves scrolling up and down the list automatically when dragging the asset item(#469)</li>\r\n<li>Fix minor bugs and improvements(#466, #467, #468)</li>\r\n</ul>","<h3 id=\"version-2-4-14-\">version 2.4.14:</h3>\r\n<ul>\r\n<li>Fix a bug that in-app purchase doesn&#39;t work by a specific type of Credit Card properly.</li>\r\n</ul>","<h3 id=\"version-2-4-13-\">version 2.4.13:</h3>\r\n<ul>\r\n<li>New feature: Allow users to insert the scene anywhere on the timeline. You can insert a new scene before the selected scene by clicking the &quot;Insert...&quot; item on the context menu of the scene(#416)</li>\r\n<li>Fix a bug that some assets don&#39;t completely erase and show a bit of the outline continually after erasing them(#453)</li>\r\n<li>Fix minor bugs and improvements(#456, #457)</li>\r\n</ul>","<h3 id=\"version-2-4-12-\">version 2.4.12:</h3>\r\n<ul>\r\n<li>Fix a bug that the subtitle often revert back to the original text when editing it on Scene Settings(#454)</li>\r\n<li>Fix minor bugs and improvements(#452)</li>\r\n</ul>","<h3 id=\"version-2-4-11-\">version 2.4.11:</h3>\r\n<ul>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-2-4-10-\">version 2.4.10:</h3>\r\n<ul>\r\n<li>New feature: Added a Doodly Rainbow on/off switch within the settings screens for individual assets, for scenes, and for the entire video to easily convert all image(s) from black and white, to color (and vice versa), simultaneously(#441)</li>\r\n<li>Fix minor bugs and improvements(#420, #450)</li>\r\n</ul>","<h3 id=\"version-2-4-9-\">version 2.4.9:</h3>\r\n<ul>\r\n<li>Improvement: When a scene is duplicated in the timeline, the setting options for the scene and all assets contained in it are copied the same(#443)</li>\r\n<li>Fix minor bugs and improvements(#436, #439, #442)</li>\r\n</ul>","<h3 id=\"version-2-4-8-\">version 2.4.8:</h3>\r\n<ul>\r\n<li>New feature: Allow users to add a subtitle to each scene. You can add a subtitle for the scene in Scene Settings modal and set to enable/disable subtitles of all scenes in Video Settings modal(#434)</li>\r\n<li>Fix a bug that Gif play speed is decreased(#424)</li>\r\n</ul>","<h3 id=\"version-2-4-7-\">version 2.4.7:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements(#435)</li>\r\n</ul>","<h3 id=\"version-2-4-6-\">version 2.4.6:</h3>\r\n<ul>\r\n<li>Improvement: Allow users to select multiple projects with Ctrl/Shift keyboard on the project list and move, duplicate, and delete them all at once(#422)</li>\r\n<li>Improvement: Allow users to upload multiple sound files at once(#417)</li>\r\n<li>Improvement: When users copy-paste or swap the asset, it shows in the same place(#427)</li>\r\n<li>Improvement: Show the sound name on tooltip by hovering the sound track(#290)</li>\r\n<li>Fix minor bugs and improvements(#419, #421, #426, #428)</li>\r\n</ul>","<h3 id=\"version-2-4-5-\">version 2.4.5:</h3>\r\n<ul>\r\n<li>Improvement: Allow users to create, rename, and delete folders to keep their projects. And also able to move projects across to the folders(#247)</li>\r\n<li>Fix minor bugs and improvements(#412, #414)</li>\r\n</ul>","<h3 id=\"version-2-4-4-\">version 2.4.4:</h3>\r\n<ul>\r\n<li>New feature: Add the &quot;Copy&quot; and &quot;Paste&quot; items for a scene on the context menu of the timeline. Users can copy and paste a scene, within and between projects, retaining all objects and timings, and settings(#379)</li>\r\n<li>Fix a bug that the asset disappears from the canvas when clicking it with CTRL after all assets are selected by CTRL+A(#413)</li>\r\n</ul>","<h3 id=\"version-2-4-3-\">version 2.4.3:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements</li>\r\n</ul>","<h3 id=\"version-2-4-2-\">version 2.4.2:</h3>\r\n<ul>\r\n<li>Improvement: Allow users to use Undo, Redo, Cut, Copy, Paste, and Select All functions in the Edit menu and add the ability to select all assets on the canvas(#400)</li>\r\n<li>Improvement: Add &quot;Video Tutorials&quot; item inside of the help menu(#410)</li>\r\n<li>Fix minor bugs and improvements(#406, #409)</li>\r\n</ul>","<h3 id=\"version-2-4-1-\">version 2.4.1:</h3>\r\n<ul>\r\n<li>Fix a bug that fails to save video</li>\r\n</ul>","<h3 id=\"version-2-4-0-\">version 2.4.0:</h3>\r\n<ul>\r\n<li>Improvement: Allow users to perform multiple operations on the image assets. Users can select multiple image assets with Ctrl/Shift keyword, delete, share, export them at once, as well as drag and put them to the canvas(#394)</li>\r\n<li>Improvement: Allow users to add an object to the canvas when the asset is double-clicked.</li>\r\n<li>Fix minor bugs and improvements(#373, #354, #402)</li>\r\n</ul>","<h3 id=\"version-2-3-9-\">version 2.3.9:</h3>\r\n<ul>\r\n<li>New feature: Allows users to upload their own profile image(#393)</li>\r\n<li>Improvement: Add a delete option on the context menu of the recent video item(#392)</li>\r\n<li>Fix minor bugs and improvements(#388, #391, #395, #396)</li>\r\n</ul>","<h3 id=\"version-2-3-8-\">version 2.3.8:</h3>\r\n<ul>\r\n<li>New feature: Bulk importing - Allows to upload multiple asset files such as images, fonts, and audios at a time(#259)</li>\r\n<li>Improvement: Allow to set a custom background for Facebook or Instagram video(#389)</li>\r\n<li>Fix minor bugs(#390)</li>\r\n</ul>","<h3 id=\"version-2-3-7-\">version 2.3.7:</h3>\r\n<ul>\r\n<li>Fix a bug that the timeline position does not align with the selected scene(#387)</li>\r\n<li>Fix minor bugs and improvements(#384, #385, #386)</li>\r\n</ul>","<h3 id=\"version-2-3-6-\">version 2.3.6:</h3>\r\n<ul>\r\n<li>New feature: Add a &quot;Reveal Mode&quot; drop-down box that sets how to reveal the color portion when editing the asset(#383)</li>\r\n<li>Fix minor bugs and improvements(#382)</li>\r\n</ul>","<h3 id=\"version-2-3-5-\">version 2.3.5:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements(#375, #381)</li>\r\n</ul>","<h3 id=\"version-2-3-4-\">version 2.3.4:</h3>\r\n<ul>\r\n<li>New feature: Add a highly requested feature that allows easy Instagram and Facebook video dimension resizing(#262)</li>\r\n<li>Improvement: Add a feature to sort the projects by created and modified date in the home screen(#368)</li>\r\n</ul>","<h3 id=\"version-2-3-3-\">version 2.3.3:</h3>\r\n<ul>\r\n<li>Improvement: Add new cartoon style hands(#374)</li>\r\n<li>Fix a bug that fail to export video according to the length of the audio file(#360)</li>\r\n</ul>","<h3 id=\"version-2-3-2-\">version 2.3.2:</h3>\r\n<ul>\r\n<li>New feature: Add a loop count spinner to set the repeat animation of GIF in Asset Settings(#372)</li>\r\n<li>Fix minor bugs and improvements(#371)</li>\r\n</ul>","<h3 id=\"version-2-3-1-\">version 2.3.1:</h3>\r\n<ul>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-2-3-0-\">version 2.3.0:</h3>\r\n<ul>\r\n<li>New feature: Gif Animation - Allows to upload and use Gif assets in characters and props (#320)</li>\r\n<li>New feature: Add/Remove Audio Tracks - Click the Add Track/Remove Track item on the context menu shown when clicking the kebab icon of each audio track (#337)</li>\r\n<li>Fix minor bugs and improvements(#361, #367)</li>\r\n</ul>","<h3 id=\"version-2-2-4-\">version 2.2.4:</h3>\r\n<ul>\r\n<li>Improvement: Add a new hand style - Santa (#369)</li>\r\n</ul>","<h3 id=\"version-2-2-3-\">version 2.2.3:</h3>\r\n<ul>\r\n<li>Bugfix: Fix bug related to Doodly Marketplace viewing</li>\r\n<li>Fix minor bugs and improvements(#363)</li>\r\n</ul>","<h3 id=\"version-2-2-2-\">version 2.2.2:</h3>\r\n<ul>\r\n<li>New feature: The New Doodly Marketplace is LIVE! The Doodly interface has changed slightly to accommodate the new marketplace. Changes include (tab navigation changed to icons, and new marketplace tab has been added; marketplace banner added to startup screen; marketplace folder icon added inside of the characters and props tabs)</li>\r\n<li>Fix minor bugs and improvements(#358, #362)</li>\r\n</ul>","<h3 id=\"version-2-2-1-\">version 2.2.1:</h3>\r\n<ul>\r\n<li>Improvement: Home screen sorts the projects by updated date in descending and loads more by scrolling (#336)</li>\r\n<li>Improvement: Stop previous playing audio when starting new audio in the list(#352)</li>\r\n<li>Bugfix: Timeline scrolls back to the first scene when changing the property of an object in the scenes(#356)</li>\r\n<li>Fix minor bugs and improvements(#347)</li>\r\n</ul>","<h3 id=\"version-2-2-0-\">version 2.2.0:</h3>\r\n<ul>\r\n<li>New feature: Panning &amp; Zooming(#170)</li>\r\n<li>Fix minor bugs(#344, #345)</li>\r\n</ul>","<h3 id=\"version-2-1-2-\">version 2.1.2:</h3>\r\n<ul>\r\n<li>Bugfix: Doodly is not allowed to access the microphone on macOS Mojave or later(#348)</li>\r\n</ul>","<h3 id=\"version-2-1-1-\">version 2.1.1:</h3>\r\n<ul>\r\n<li>Improvement: Add new cartoon style hands(#341)</li>\r\n<li>Bugfix: When adding a new scene in case that &quot;Scene transition&quot; is set &quot;Camera panning&quot; in Video Settings, &quot;Exit animation&quot; of the new scene is set &quot;None&quot; and camera panning doesn&#39;t work properly(#338)</li>\r\n<li>Bugfix: &quot;Erase mode&quot; is not available from third hand in Video Settings(#343)</li>\r\n<li>Bugfix: Exporting videos with the title including &quot;Error&quot; causes an error(#346)</li>\r\n</ul>","<h3 id=\"version-2-1-0-\">version 2.1.0:</h3>\r\n<ul>\r\n<li>Improvement: Show asset name in Asset Settings(#340)</li>\r\n<li>Bugfix: When changing save location in video export, &quot;Save As&quot; file type does not reflect the chosen type(#339)</li>\r\n<li>Fix minor bugs and improvements(#342)</li>\r\n</ul>","<h3 id=\"version-2-0-11-\">version 2.0.11:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements</li>\r\n</ul>","<h3 id=\"version-2-0-10-\">version 2.0.10:</h3>\r\n<ul>\r\n<li>Bugfix: Arabic text is not rendered properly(#329)</li>\r\n<li>Bugfix: Text is rendered larger than actual pixels of font-size specified(#334)</li>\r\n<li>Bugfix: When dragging a sound in the audio timeline and dropping in the out of timeline, the pink/green box doesn&#39;t disappear(#335)</li>\r\n</ul>","<h3 id=\"version-2-0-9-\">version 2.0.9:</h3>\r\n<ul>\r\n<li>New feature: Add &quot;Remember Me&quot; option in login screen(#332)</li>\r\n<li>Fix minor bugs(#333)</li>\r\n</ul>","<h3 id=\"version-2-0-8-\">version 2.0.8:</h3>\r\n<ul>\r\n<li>New feature: Select multiple by context menu to delete, share or export assets in asset list(#326)</li>\r\n<li>New feature: Show/hide Doodler Toolbox</li>\r\n</ul>","<h3 id=\"version-2-0-7-\">version 2.0.7:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements</li>\r\n</ul>","<h3 id=\"version-2-0-6-\">version 2.0.6:</h3>\r\n<ul>\r\n<li>Fix minor bugs and improvements(#327, #328)</li>\r\n</ul>","<h3 id=\"version-2-0-5-\">version 2.0.5:</h3>\r\n<ul>\r\n<li>New feature: Replace image, font by drag and drop on to the scene from asset list(#280)</li>\r\n<li>Fix minor bugs and improvements(#323, #324, #325)</li>\r\n</ul>","<h3 id=\"version-2-0-4-\">version 2.0.4:</h3>\r\n<ul>\r\n<li>New feature: Autofill file name of imported asset(#321)</li>\r\n<li>New feature: Change the drawpath background(Black, Transparent) when dealing with white images(#318)</li>\r\n</ul>","<h3 id=\"version-2-0-3-\">version 2.0.3:</h3>\r\n<ul>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-2-0-2-\">version 2.0.2:</h3>\r\n<ul>\r\n<li>New feature: Add &quot;Invert&quot; option in Asset Settings(#315)</li>\r\n<li>Bugfix: Scrolling for characters doesn&#39;t work properly in some cases(#319)</li>\r\n</ul>","<h3 id=\"version-2-0-1-\">version 2.0.1:</h3>\r\n<ul>\r\n<li>Improvement: Doodly Rainbow Scene Templates</li>\r\n</ul>","<h3 id=\"version-2-0-0-\">version 2.0.0:</h3>\r\n<ul>\r\n<li>New feature: Doodly Rainbow Addon</li>\r\n</ul>","<h3 id=\"version-1-19-18-\">version 1.19.18:</h3>\r\n<ul>\r\n<li>Bugfix: Color images don&#39;t render properly on Chalkboard(#310)</li>\r\n<li>Bugfix: Asset Settings window appears when click +/- buttons quickly in right panel(#312)</li>\r\n<li>Fix minor bugs(#306, #309, #314)</li>\r\n</ul>","<h3 id=\"version-1-19-17-\">version 1.19.17:</h3>\r\n<ul>\r\n<li>New feature: Allowing export/import of users’ characters/props(#296)</li>\r\n<li>Bugfix: The position is changed when color is changed by groups(#304)</li>\r\n<li>Bugfix: Remove error alert while auto-saving works in the background(#305)</li>\r\n<li>Bugfix: The shared assets are not authorized in the backend(#303)</li>\r\n</ul>","<h3 id=\"version-1-19-16-\">version 1.19.16:</h3>\r\n<ul>\r\n<li>Improvement: The changelog in Update window is needed to be able to select and copy(#301)</li>\r\n<li>Bugfix: The position of asset is wrong in asset preview(#300)</li>\r\n<li>Bugfix: The position of eraser hand is wrong in a video(#302)</li>\r\n</ul>","<h3 id=\"version-1-19-15-\">version 1.19.15:</h3>\r\n<ul>\r\n<li>New feature: Add input of position, width, height, font size, rotate and flip in Asset Settings(#287)</li>\r\n<li>Bugfix: If auto-save is triggered while creating draw paths, all unsaved paths are erased(#297)</li>\r\n</ul>","<h3 id=\"version-1-19-14-\">version 1.19.14:</h3>\r\n<ul>\r\n<li>New feature: Add &quot;Word Wrap&quot; option in Text Edit dialog that it will wrap within defined boundary box size(#192)</li>\r\n<li>Improvement: Selecting objects by its boundary box to avoid the difficulty for transparent images(#295)</li>\r\n<li>Bugfix: Camera Panning scene transition causes scenes to overlap if exporting is above 480p(#285)</li>\r\n</ul>","<h3 id=\"version-1-19-13-\">version 1.19.13:</h3>\r\n<ul>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-1-19-12-\">version 1.19.12:</h3>\r\n<ul>\r\n<li>New feature: Enable/Disable AutoSave on Video Settings(#237)</li>\r\n<li>Improve to use a short PIN code instead of long reset token for Forgot Password(#244)</li>\r\n</ul>","<h3 id=\"version-1-19-11-\">version 1.19.11:</h3>\r\n<ul>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-1-19-10-\">version 1.19.10:</h3>\r\n<ul>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-1-19-9-\">version 1.19.9:</h3>\r\n<ul>\r\n<li>New feature: Support new video formats to export - MKV, OGG, WebM.</li>\r\n</ul>","<h3 id=\"version-1-19-8-\">version 1.19.8:</h3>\r\n<ul>\r\n<li>Fix a bug that project not opening which has big amount of assets(#289)</li>\r\n</ul>","<h3 id=\"version-1-19-7-\">version 1.19.7:</h3>\r\n<ul>\r\n<li>New feature: Add new Cartoon style hands(#283)</li>\r\n<li>Fix a bug that color picker is cropped on Scene Settings that are less than 1080p(#276)</li>\r\n<li>Fix a bug that project rename via settings not working(#273)</li>\r\n<li>Fix a bug that draw path icon disappearing from custom images(#282)</li>\r\n</ul>","<h3 id=\"version-1-19-6-\">version 1.19.6:</h3>\r\n<ul>\r\n<li>Fix a bug that the duration of sound effect has negative value when resizing(#278)</li>\r\n<li>Support the video codec for Twitter</li>\r\n</ul>","<h3 id=\"version-1-19-5-\">version 1.19.5:</h3>\r\n<ul>\r\n<li>Fix a bug that search not working properly for shared images(#272)</li>\r\n</ul>","<h3 id=\"version-1-19-4-\">version 1.19.4:</h3>\r\n<ul>\r\n<li>Fix a bug that custom colored background in combination with marker causes white filled in silhouette(#210)</li>\r\n<li>Fix a bug that asset drag trail appears when using transparent image background(#230)</li>\r\n<li>Fix a bug to prevent wrong font files to be uploaded(#219, #245)</li>\r\n<li>Fix a bug that gray images blend with custom black background(#250)</li>\r\n<li>Fix a bug that shared assets not loading(#268)</li>\r\n<li>Fix a bug that tooltips for club images appear all the time(#270)</li>\r\n</ul>","<h3 id=\"version-1-19-3-\">version 1.19.3:</h3>\r\n<ul>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-1-19-2-\">version 1.19.2:</h3>\r\n<ul>\r\n<li>Fix a bug that &quot;Extra time at the end&quot; scene option not applying to project(#227)</li>\r\n<li>Fix a bug to prevent project title from HTML(#254)</li>\r\n<li>Fix a bug that &quot;Duration&quot; and &quot;Delay&quot; item options not saving if &quot;s&quot; is included(#257)</li>\r\n<li>Fix a bug that long titles overlap on Sounds Tab(#267)</li>\r\n</ul>","<h3 id=\"version-1-19-1-\">version 1.19.1:</h3>\r\n<ul>\r\n<li>Fix a bug that it looks like you are dragging the entire window when you drag an audio track into the timeline(#266)</li>\r\n<li>Fix a bug that video exporting has an error in odd size(#241)</li>\r\n<li>Fix a bug that images are not uploading in some cases even though the size is less than 1920(#253)</li>\r\n</ul>","<h3 id=\"version-1-19-0-\">version 1.19.0:</h3>\r\n<ul>\r\n<li>Improve Shared tab to revoke the assets shared</li>\r\n<li>Improve Shared tab to revoke the assets shared</li>\r\n<li>Add Terms &amp; Conditions Popup</li>\r\n</ul>","<h3 id=\"version-1-18-9-\">version 1.18.9:</h3>\r\n<ul>\r\n<li>Merry Christmas &amp; Happy New Year!</li>\r\n<li>New feature: Add &quot;Delete&quot; option in right-click context menu to delete an audio from timeline</li>\r\n<li>Improve to import paths from SVG image(Beta ## version). Now it supports most of SVG images</li>\r\n<li>Fix a bug that some of custom fonts were not available</li>\r\n<li>Fix a bug that the lines in video was flickering according to the resolution</li>\r\n<li>Allow standard users to see Enterprise level assets</li>\r\n</ul>","<h3 id=\"version-1-18-8-\">version 1.18.8:</h3>\r\n<ul>\r\n<li>Fix a major bug that custom image on video/scene settings is broken sometimes</li>\r\n<li>Improve performance on canvas drawing</li>\r\n</ul>","<h3 id=\"version-1-18-7-\">version 1.18.7:</h3>\r\n<ul>\r\n<li>Fix a bug that opacity does not save if set to 0%</li>\r\n<li>Fix a bug that imported color blocks randomly turn gray</li>\r\n</ul>","<h3 id=\"version-1-18-6-\">version 1.18.6:</h3>\r\n<ul>\r\n<li>Fix a bug that 4k video output for blackboard crops images and text</li>\r\n<li>Fix minor bugs</li>\r\n</ul>","<h3 id=\"version-1-18-5-\">version 1.18.5:</h3>\r\n<ul>\r\n<li>Fix a bug that &quot;Shared&quot; tab not showing on Standard membership</li>\r\n<li>Fix a bug that video exporting failed with the filename containing special characters</li>\r\n<li>Fix a bug that custom color board exported wrong</li>\r\n</ul>","<h3 id=\"version-1-18-4-\">version 1.18.4:</h3>\r\n<ul>\r\n<li>Fix minor bugs including typo</li>\r\n</ul>","<h3 id=\"version-1-18-3-\">version 1.18.3:</h3>\r\n<ul>\r\n<li>New feature: Add scene settings to choose board style &amp; hand type per secen</li>\r\n<li>New feature: Add ability to import paths from SVG image(Alpha ## version)</li>\r\n</ul>","<h3 id=\"version-1-18-2-\">version 1.18.2:</h3>\r\n<ul>\r\n<li>Fix a bug that some fonts not visible in preview or export</li>\r\n</ul>","<h3 id=\"version-1-18-1-\">version 1.18.1:</h3>\r\n<ul>\r\n<li>Fix minor bugs on 1.18.0</li>\r\n</ul>","<h3 id=\"version-1-18-0-\">version 1.18.0:</h3>\r\n<ul>\r\n<li>New feature: Sharing custom images with draw paths to other users inside Doodly</li>\r\n<li>New feature: Resizing with upper/left corner anchored</li>\r\n<li>New feature: Add black hands</li>\r\n<li>New feature: Add &quot;Erase&quot; as an exit animation</li>\r\n<li>New feature: &quot;Redo&quot; is available now and fix bugs on &quot;Undo&quot;.</li>\r\n<li>Fix a bug that preview hanging while transitioning in some cases</li>\r\n<li>Fix a bug that exporting failed in some cases</li>\r\n<li>Fix a bug that some fonts appear cropped in the preview panel and also in the right margin</li>\r\n</ul>","<h3 id=\"version-1-17-2-\">version 1.17.2:</h3>\r\n<ul>\r\n<li>Fix a bug that login text box is not available to copy &amp; paste</li>\r\n<li>Fix a bug that arrow key moves text during editing</li>\r\n</ul>","<h3 id=\"version-1-17-1-\">version 1.17.1:</h3>\r\n<ul>\r\n<li>Fix a minor bug for &quot;New path&quot; button</li>\r\n</ul>","<h3 id=\"version-1-17-0-\">version 1.17.0:</h3>\r\n<ul>\r\n<li>New feature: Ability to hide and unhide the left and right windows</li>\r\n<li>New feature: Add an opacity spinner on Asset Settings to adjust the transparency of images</li>\r\n<li>Fix a bug on selecting a category for Props to scroll down to see the rest of categories in case of small screen.</li>\r\n<li>Optimized code base internally for performance</li>\r\n</ul>","<h3 id=\"version-1-16-7-\">version 1.16.7:</h3>\r\n<ul>\r\n<li>Fix a bug with audio syncing on preview vs exported video</li>\r\n<li>Fix a minor bug on search filter</li>\r\n</ul>","<h3 id=\"version-1-16-6-\">version 1.16.6:</h3>\r\n<ul>\r\n<li>New feature: Add ability to cut, copy, paste assets by right-click context menu or shortcut key.</li>\r\n<li>Fix a bug on selection area when move asset by arrow key, zoom in/out, scroll canvas, resize windows.</li>\r\n<li>Fix a bug that search box pops out and extends to canvas.</li>\r\n<li>Fix a bug that video was not exporting well with the recorded audio before save.</li>\r\n<li>Fix a bug that single color image shows gray on canvas.</li>\r\n<li>Fix a bug that timeline resizing was not working in a particular case.</li>\r\n</ul>","<h3 id=\"version-1-16-5-\">version 1.16.5:</h3>\r\n<ul>\r\n<li>Fix a bug on applying outline color to image asset.</li>\r\n</ul>","<h3 id=\"version-1-16-4-\">version 1.16.4:</h3>\r\n<ul>\r\n<li>Fix minor bugs including typo.</li>\r\n</ul>","<h3 id=\"version-1-16-3-\">version 1.16.3:</h3>\r\n<ul>\r\n<li>New feature: RTL(Right to Left) option is available when edit text.</li>\r\n<li>New feature: Left-Handed style is available on Video Setting.</li>\r\n</ul>","<h3 id=\"version-1-16-2-\">version 1.16.2:</h3>\r\n<ul>\r\n<li>Fix a bug on scene setting button.</li>\r\n</ul>","<h3 id=\"version-1-16-1-\">version 1.16.1:</h3>\r\n<ul>\r\n<li>Enhancement: New board style &quot;Custom&quot; is available to choose Marker, Chalk mode.</li>\r\n<li>Fix a bug on copy &amp; paste.</li>\r\n</ul>","<h3 id=\"version-1-16-0-\">version 1.16.0:</h3>\r\n<ul>\r\n<li>New feature: New board style &quot;Custom&quot; is available with background color and image.</li>\r\n<li>Fix a bug that would keep order by group backward/forward.</li>\r\n<li>Fix a bug that would show/hide grid well.</li>\r\n<li>Enhancement for backend security.</li>\r\n</ul>","<h3 id=\"version-1-15-1-\">version 1.15.1:</h3>\r\n<ul>\r\n<li>Fixed a minor bug. If your version 1.15.0 is not working well for new features, plz upgrade to this version. Thank you!</li>\r\n</ul>","<h3 id=\"version-1-15-0-\">version 1.15.0:</h3>\r\n<ul>\r\n<li>New feature: Add ability to select multiple assets on the canvas at once by holding the control key and clicking on elements... so you can move them all around together. Plus change settings on all images at once.</li>\r\n<li>New feature: Add ability for users to rename recorded audio files</li>\r\n<li>New feature: Adjust canvas size so you can export to custom dimensions</li>\r\n</ul>","<h3 id=\"version-1-14-4-\">version 1.14.4:</h3>\r\n<ul>\r\n<li>Fix a bug that would prevent users from seeing all club months on small screens</li>\r\n</ul>","<h3 id=\"version-1-14-3-\">version 1.14.3:</h3>\r\n<ul>\r\n<li>Allow access to all Doodly Club assets for Platinum and Enterprise memberships</li>\r\n<li>Fix a bug that would allow asset delay and duration to become less than 0s</li>\r\n</ul>","<h3 id=\"version-1-14-2-\">version 1.14.2:</h3>\r\n<ul>\r\n<li>Fixed a bug concerning recorded audio files</li>\r\n</ul>","<h3 id=\"version-1-14-1-\">version 1.14.1:</h3>\r\n<p>Bug Fixes:</p>\r\n<ul>\r\n<li>Fixed a bug that would prevent the user from editing path names / video title</li>\r\n<li>Fixed a bug that would allow the user to upload unsupported audio format files</li>\r\n</ul>\r\n<p>Bug Fixes:</p>\r\n<ul>\r\n<li>Fixed issues with videos not exporting with multiple sound and effects</li>\r\n<li>Fixed issue with audio clipping</li>\r\n</ul>","<h3 id=\"version-1-14-0-\">version 1.14.0:</h3>\r\n<p>New Feature Release: Audio Recording right inside of Doodly! Click on the + button on the bottom audio line. Simply move it and clip it as you wish like all other recordings.</p>","<h3 id=\"version-1-13-3-\">version 1.13.3:</h3>\r\n<ul>\r\n<li>Fixed a bug that caused audio to be cut less than 1 second earlier while exporting.</li>\r\n</ul>","<h3 id=\"version-1-13-0-1-13-2-\">version 1.13.0 - 1.13.2:</h3>\r\n<ul>\r\n<li>New feature: Audio clipping: simply drag either end of the audio segment to remove unwanted parts.</li>\r\n<li>New feature: Audio effects (Fade In / Out): right click the audio segment to toggle fade in / out effects. Once the effect is enabled, you&#39;ll be able to change its duration by dragging the inner end of the blue shape.</li>\r\n<li>Bug fix: Allow users to reset their forgotten password.</li>\r\n</ul>","<h3 id=\"version-1-12-5-\">version 1.12.5:</h3>\r\n<ul>\r\n<li>Bug fix: Allow users to correctly set scene extra time, on a per scene basis.</li>\r\n<li>Fixed a bug that would prevent users form logging in</li>\r\n</ul>","<h3 id=\"version-1-12-4-\">version 1.12.4:</h3>\r\n<ul>\r\n<li>Bug fix: Allow user to correctly preview and export videos on macOS</li>\r\n</ul>","<h3 id=\"version-1-12-3-\">version 1.12.3:</h3>\r\n<ul>\r\n<li>Bug fix: Render greenboard videos correctly.</li>\r\n</ul>","<h3 id=\"version-1-12-2-\">version 1.12.2:</h3>\r\n<ul>\r\n<li>Bug fix: Allow new videos to be created using the new glassboard style.</li>\r\n<li>Bug fix: Switching video style to glassboard works properly now.</li>\r\n</ul>","<h3 id=\"version-1-12-1-\">version 1.12.1:</h3>\r\n<ul>\r\n<li>Bug fix: Colored text should be drawn with the correct color on glassboard.</li>\r\n</ul>","<h3 id=\"version-1-12-0-\">version 1.12.0:</h3>\r\n<ul>\r\n<li>New Feature: Added all new, glassboard video type.</li>\r\n</ul>","<h3 id=\"version-1-11-1-\">version 1.11.1:</h3>\r\n<ul>\r\n<li>Bug fix: Moving items around the board (in blackboard mode) was terribly slow.</li>\r\n<li>Bug fix: Text thumbnail in the right-hand sidebar says “Placeholder” instead of the actual text.</li>\r\n</ul>","<h3 id=\"version-1-11-0-\">version 1.11.0:</h3>\r\n<ul>\r\n<li>New Feature: Added camera panning transitions. After a scene is drawn, the camera will pain to another location on the whiteboard/blackboard where the next scene will be drawn.</li>\r\n<li>New Feature: We&#39;ve added another female hand to the list.</li>\r\n<li>Bug Fix: If no hand set is selected, and something is being erased, Doodly will no longer error.</li>\r\n</ul>","<h3 id=\"version-1-10-2-\">version 1.10.2:</h3>\r\n<ul>\r\n<li>Various minor performance and stability improvements</li>\r\n</ul>","<h3 id=\"version-1-10-1-\">version 1.10.1:</h3>\r\n<ul>\r\n<li>Bug Fix: Copy and Paste is working again :)</li>\r\n<li>Bug Fix: Save and Return on Draw Path (saving issue fixed)</li>\r\n<li>Bug Fix: Color Picker Popup issue addressed (You can now pick swatches and enter hex freely on color section)</li>\r\n<li>Bug Fix: Error Reporting on Exporting patched.</li>\r\n<li>Jan 2017 Doodly Club Release</li>\r\n</ul>","<h3 id=\"version-1-10-0-\">version 1.10.0:</h3>\r\n<ul>\r\n<li>New Feature Release: Erase Individual Assets - Simply right click and choose erase (this will set the animation to “erase” and duplicate frame showing you the same frame WITHOUT erase asset). Simply click on the gear above the asset - you’ll see entry and exit animation that you can adjust to the next scene.</li>\r\n<li>New Feature Release: Green Chalk Board - Click on Settings on the bottom left to access!</li>\r\n<li>Bug Fix: Exporting videos with second audio channel glitch.</li>\r\n<li>Bug Fix: Exporting videos with one or two audio channel.</li>\r\n<li>Bug Fix: Copy and Paste issue fixed.</li>\r\n<li>Bug Fix: Exporting error now displayed with errors</li>\r\n</ul>","<h3 id=\"version-1-9-0-\">version 1.9.0:</h3>\r\n<ul>\r\n<li>New Feature: Copy and Paste of Assets! You can now copy images from scene to scenes AND/OR inside the same scenes! Use Control C/Control V on PC and Command C /Command V on Mac.</li>\r\n<li>New Feature: You now have the ability to move images with the arrow keys! Click on the image, use your keyboard arrow keys to move the image up and down for precision.</li>\r\n<li>New Feature: Erasers and Smudge now available for “white man with black sleeve” and white woman in both black and white board.</li>\r\n<li>Feature Update: Improved Controls for Playback. You now have a play and pause button for previews! Along with a progress bar so you can jump back and forth!</li>\r\n</ul>","<h3 id=\"version-1-8-1-\">version 1.8.1:</h3>\r\n<ul>\r\n<li>Fixed a bug that was preventing assets to have 0s animation time</li>\r\n</ul>","<h3 id=\"version-1-8-0-\">version 1.8.0:</h3>\r\n<ul>\r\n<li>New Feature: Introducing Doodly Auto-Erase - Allows you to add erasing automatically when you stack two images on top of each other. Auto-Erase is offered in both finger erase or eraser styles. Pick from Smart Mode (automatic), Eraser Only, Finger Only, or Off. (Currently only available for 1 hand in white board and 1 hand in blackboard)</li>\r\n</ul>\r\n<p>To activate, simply go to settings on the bottom left of your Doodly and IF the hand setting has auto-erase feature available, pick the setting from the drop down box.</p>\r\n<p>Other hand erase styles coming soon!</p>\r\n<ul>\r\n<li>Bug Fix: Audio drag and drop feature updated and tweaked for better performance</li>\r\n</ul>","<h3 id=\"version-1-7-2-\">version 1.7.2:</h3>\r\n<ul>\r\n<li>Bug Fix: Title Display Issue is now resolved.</li>\r\n<li>Bug Fix: Preview Scene Audio Issue has been resolved.</li>\r\n</ul>","<h3 id=\"version-1-7-1-\">version 1.7.1:</h3>\r\n<ul>\r\n<li>Quick Bug Fix: Duplicate Audio Segment issue fixed</li>\r\n</ul>","<h3 id=\"version-1-7-0-\">version 1.7.0:</h3>\r\n<ul>\r\n<li>New Feature Release: Two Audio Channels (Background Music &amp; Voice Audio)</li>\r\n<li>New Feature: Drag and Drop Audio Segments between channels</li>\r\n<li>New Feature: Adjust volume of each audio channel by simply clicking the volume icon - and clicking/using your keyboard to adjust the volume levels</li>\r\n<li>Bug Fix - Drag and drop audio from Sound tab to Audio Channel of your choice</li>\r\n<li>Bug Fix - Export Videos now with a “/“ and “\\” in their titles</li>\r\n</ul>","<h3 id=\"version-1-6-0-\">version 1.6.0:</h3>\r\n<ul>\r\n<li>New Feature: Video Copy! Quickly duplicate your favorite video by right clicking on any video in the main my video screen and choose duplicate!</li>\r\n<li>App Responsiveness Improvement - We’ve increased the speed up to 20x FASTER with this update.</li>\r\n<li>Bug Fix: Multi-line text with color issue fixed!</li>\r\n</ul>","<h3 id=\"version-1-5-0-\">version 1.5.0:</h3>\r\n<ul>\r\n<li>Feature Release: We’ve added COLOR! By popular demand, you can now add color to pre-loaded assets of Doodly! Simply select the asset, click the “gear” on the top left and you’ll be given a color option.</li>\r\n<li>Minor Updates to speed of platform in saving and assets/scenes.</li>\r\n<li>Minor Update to resizing images - We&#39;ve improved the quality when scaling a picture.</li>\r\n<li>Doodly Club is still available at <a href=\"http://doodly.com/club\">http://doodly.com/club</a></li>\r\n</ul>","<h3 id=\"version-1-4-1-\">version 1.4.1:</h3>\r\n<ul>\r\n<li>Fixed minor bug for audio “load” issue</li>\r\n<li>Fixed minor bug for audio segments being “jittery.” You can now move segments of audio left and right.</li>\r\n</ul>","<h3 id=\"version-1-4-0-\">version 1.4.0:</h3>\r\n<ul>\r\n<li>New Feature Update: Grid is now LIVE! You now have the ability to show/hide the grid on canvas for alignment.</li>\r\n<li>New Feature Update: Ability to draw WITHOUT using a hand! (Available in both white and blackboard)</li>\r\n<li>Export Update - We now save your last session’s export settings as the default for future exports</li>\r\n<li>Doodly Club available at <a href=\"http://doodly.com/club\">http://doodly.com/club</a></li>\r\n</ul>","<h3 id=\"version-1-3-2-\">version 1.3.2:</h3>\r\n<ul>\r\n<li>NEW Hands! (White woman blackboard, Brown woman Whiteboard and Blackboard, Brown man whiteboard and blackboard)</li>\r\n<li>Update on Hands for “smoother” appearance</li>\r\n<li>New updates to Club badging and display</li>\r\n<li>Improved saving with progress bar - displaying % of saving status!</li>\r\n<li>Small bug that caused saving issues - fixed!</li>\r\n</ul>","<h3 id=\"version-1-3-1-\">version 1.3.1:</h3>\r\n<ul>\r\n<li>Doodly Club is coming…</li>\r\n<li>Update addresses bug that caused “Duplicate Scenes” to not save properly.</li>\r\n<li>Update addresses bug that did not allow “Saves” after flipping an asset/changing text alignment.</li>\r\n</ul>","<h3 id=\"version-1-3-0-\">version 1.3.0:</h3>\r\n<ul>\r\n<li>added ability to duplicate scenes</li>\r\n<li>added ability to change the exit animation of scenes (only none / swipe-left for now)</li>\r\n<li>lowered the minimum duration (animation time) of an image / text down to 0s</li>\r\n<li>fixed a bug that would allow user to enter empty text into a scene, which could prevent the video from exporting correctly</li>\r\n</ul>","<h3 id=\"version-1-2-4-\">version 1.2.4:</h3>\r\n<ul>\r\n<li>improved saving videos</li>\r\n<li>fixed re-ordering scenes in the video timeline</li>\r\n<li>fixed a bug that was causing bring forwards / send backwards not to work on thin objects</li>\r\n<li>other minor improvements for low resolution screens</li>\r\n</ul>","<h3 id=\"version-1-2-3-\">version 1.2.3:</h3>\r\n<ul>\r\n<li>updated My Videos screen</li>\r\n<li>updated Video Settings popup to make it easier to choose between the drawing hands</li>\r\n<li>allow the app window to be resized down to 1024 x 768 to accommodate some lower resolutions</li>\r\n<li>minor bug fixes and improvements</li>\r\n</ul>","<h3 id=\"version-1-2-2-\">version 1.2.2:</h3>\r\n<ul>\r\n<li>previewing now also highlights the current position in the audio timeline</li>\r\n<li>fixed a bug that was causing fonts to jump vertically after being drawn</li>\r\n<li>fixed a bug that was causing some fonts to be cut off horizontally</li>\r\n<li>fixed a bug that was causing audio to appear longer inside the video timeline than in the exported videos</li>\r\n<li>fixed a bug that was causing previewing to play the same audio segment multiple times</li>\r\n<li>fixed a bug that was sometimes causing exporting to being stuck at 82% (while downloading audio)</li>\r\n<li>fixed a bug that was sometimes causing exported video to have almost mono audio (one channel had lower volume)</li>\r\n</ul>","<h3 id=\"version-1-2-1-\">version 1.2.1:</h3>\r\n<ul>\r\n<li>fixed a bug that was causing the font descender to be cut off</li>\r\n<li>fixed a bug that was causing high memory usage when using large font files</li>\r\n</ul>","<h3 id=\"version-1-2-0-\">version 1.2.0:</h3>\r\n<ul>\r\n<li>added ability to add extra time at the end of each frame individually</li>\r\n<li>added ability to delete assets (images / fonts / sounds) that were previously uploaded by the user</li>\r\n<li>moved &quot;Preview Scene&quot; functionality from the right sidebar to the right-click menu on the scene in the video timeline</li>\r\n<li>added audio to &quot;Preview Scene&quot;</li>\r\n<li>fixed bug that was causing Windows setup to fail on some PCs</li>\r\n<li>fixed bug that was causing exported video to be scrambled on Windows Media Player</li>\r\n<li>other bug fixes and stability improvements</li>\r\n</ul>","<h3 id=\"version-1-1-0-\">version 1.1.0:</h3>\r\n<ul>\r\n<li>added SVG support</li>\r\n<li>fixed bug that caused the exported video to play past the end of animation, regardless of settings</li>\r\n</ul>","<h3 id=\"version-1-0-0-\">version 1.0.0:</h3>\r\n<ul>\r\n<li>bug fixes and stability improvements</li>\r\n</ul>","<h3 id=\"version-0-9-0-\">version 0.9.0:</h3>\r\n<ul>\r\n<li>added more hand sets</li>\r\n<li>added search filters (for users that upgraded to PRO)</li>\r\n<li>fixed the amount of blurring on hand when exporting video</li>\r\n<li>other bug fixes and stability improvements</li>\r\n</ul>","<h3 id=\"version-0-8-2-\">version 0.8.2:</h3>\r\n<ul>\r\n<li>fixed bugs that caused the audio to preview incorrectly</li>\r\n<li>fixed bugs that caused the exporting to fail</li>\r\n<li>improved audio previewing</li>\r\n<li>other several minor bug fixes</li>\r\n</ul>","<h3 id=\"version-0-8-1-\">version 0.8.1:</h3>\r\n<ul>\r\n<li>fixed a bug that was causing the second asset of the same type on the same scene to be drawn incorrectly</li>\r\n</ul>","<h3 id=\"version-0-8-0-\">version 0.8.0:</h3>\r\n<ul>\r\n<li>added undo functionality for videos (you can undo moving, resizing, rotating, changing animation duration / delay). The undo history is on a per scene basis.</li>\r\n</ul>","<h3 id=\"version-0-7-6-\">version 0.7.6:</h3>\r\n<ul>\r\n<li>fixed bug that was causing video exporting to fail</li>\r\n</ul>","<h3 id=\"version-0-7-4-0-7-5-\">version 0.7.4 - 0.7.5:</h3>\r\n<ul>\r\n<li>fix bug that was causing the app to freeze when previewing newly created videos</li>\r\n<li>minor bug fixes</li>\r\n</ul>","<h3 id=\"version-0-7-0-0-7-3-\">version 0.7.0 - 0.7.3:</h3>\r\n<ul>\r\n<li>allow users to change hand style based on the board style</li>\r\n<li>bug fixes</li>\r\n</ul>","<h3 id=\"version-0-6-2-\">version 0.6.2:</h3>\r\n<ul>\r\n<li>allow users to upload their own fonts</li>\r\n<li>bug fixes</li>\r\n</ul>","<h3 id=\"version-0-6-0-\">version 0.6.0:</h3>\r\n<ul>\r\n<li>optimized / fixed video exporting</li>\r\n<li>fixed assets being jumpy while rendering video</li>\r\n<li>other minor fixes / speed improvements</li>\r\n</ul>","<h3 id=\"version-0-5-1-\">version 0.5.1:</h3>\r\n<ul>\r\n<li>fix bug causing video exporting to crash when audio is longer than animation time</li>\r\n</ul>","<h3 id=\"version-0-5-0-\">version 0.5.0:</h3>\r\n<ul>\r\n<li>added support for various user levels</li>\r\n<li>bug fixes</li>\r\n</ul>","<h3 id=\"version-0-4-0-\">version 0.4.0:</h3>\r\n<ul>\r\n<li>show proper update changelog when an update is available</li>\r\n<li>improved video exporting, to work on low RAM / HDD space devices</li>\r\n<li>prompt saving video if needed when navigating away from video editor (including when applying an update)</li>\r\n<li>allow users to delete an asset they&#39;ve uploaded to their Library</li>\r\n<li>allow users to change when a video ends (when the animation ends or when both the animation and the audio end)</li>\r\n<li>added forgot password functionality</li>\r\n<li>added user details screen to allow the user to change their password</li>\r\n</ul>","<h3 id=\"version-0-3-1-\">version 0.3.1:</h3>\r\n<ul>\r\n<li>allow users to edit reveal paths for the assets from their own Library</li>\r\n</ul>","<h3 id=\"version-0-3-0-\">version 0.3.0:</h3>\r\n<ul>\r\n<li>added feature to allow users to upload their own characters / props</li>\r\n</ul>","<h3 id=\"version-0-2-0-\">version 0.2.0:</h3>\r\n<ul>\r\n<li>added search functionality for Characters, Props and Sounds</li>\r\n</ul>","<h3 id=\"version-0-1-0-\">version 0.1.0:</h3>\r\n<ul>\r\n<li>provide installers</li>\r\n<li>added app auto- updating</li>\r\n</ul>"]